tymek22/Clock/Firmware/CYBLE-224110-00_Clock/CYBLE-224110-00 Clock firmware.cydsn/Generated_Source/PSoC4/ledStrip_StringSel.h
/*******************************************************************************
* File Name: ledStrip_StringSel.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_ledStrip_StringSel_H) /* CY_CONTROL_REG_ledStrip_StringSel_H */
#define CY_CONTROL_REG_ledStrip_StringSel_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} ledStrip_StringSel_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    ledStrip_StringSel_Write(uint8 control) ;
uint8   ledStrip_StringSel_Read(void) ;

void ledStrip_StringSel_SaveConfig(void) ;
void ledStrip_StringSel_RestoreConfig(void) ;
void ledStrip_StringSel_Sleep(void) ; 
void ledStrip_StringSel_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define ledStrip_StringSel_Control        (* (reg8 *) ledStrip_StringSel_Sync_ctrl_reg__CONTROL_REG )
#define ledStrip_StringSel_Control_PTR    (  (reg8 *) ledStrip_StringSel_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_ledStrip_StringSel_H */


/* [] END OF FILE */
